<a href="https://colab.research.google.com/github/19PA1A0263/AI-lab/blob/master/Untitled8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


1) Create a dataframe manually

In [2]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"Roll No":["EEE263","EEE2A5","EEE275"],"Name":["M.Sai Reshmika","Y.Kavya Sree","P.Deepthi Bhavana"]})
df

  Roll No               Name
0  EEE263     M.Sai Reshmika
1  EEE2A5       Y.Kavya Sree
2  EEE275  P.Deepthi Bhavana


2) Import data into a Data Frame.

In [21]:
import pandas as pd
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

3)Adding,Deleting,Modifying the rows/columns in a dataframe


3.1) Adding a column

In [20]:
host_day=pd.read_csv("hostlers_day_scholars (1).csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [18]:
host_day.shape

(117, 1)

In [19]:
df["hostler/dayscholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostler/dayscholar
0        1      M  ...       Not placed                   d
1        2      F  ...           Placed                   d
2        3      F  ...       Not placed                   d
3        4      M  ...       Not placed                   d
4        5      M  ...       Not placed                   h

[5 rows x 10 columns]


3.2) Deleting a column.

In [22]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  B.Tech_percentage  Backlogs  placement status
0        1      M       A  ...              40.00        18        Not placed
1        2      F       A  ...              71.45         0            Placed
2        3      F       A  ...              45.26        13        Not placed
3        4      M       A  ...              36.47        17        Not placed
4        5      M       A  ...              42.52        17        Not placed

[5 rows x 8 columns]

3.3)Adding a row

In [24]:
df1=pd.DataFrame({'Roll No': [118],'Gender':["F"],'Section': ["c"], "SSC Percentage": [98.4],'inter_Diploma_percentage':[99],'B.Tech_percentage':[75],'Backlogs': [0], 'placement status': ["Not placed"],"hostler/dayscholar":["h"]})
df1

   Roll No Gender Section  ...  Backlogs  placement status  hostler/dayscholar
0      118      F       c  ...         0        Not placed                   h

[1 rows x 9 columns]

In [25]:
df=df.append(df)
df.head()

   Roll No Gender Section  ...  B.Tech_percentage  Backlogs  placement status
0        1      M       A  ...              40.00        18        Not placed
1        2      F       A  ...              71.45         0            Placed
2        3      F       A  ...              45.26        13        Not placed
3        4      M       A  ...              36.47        17        Not placed
4        5      M       A  ...              42.52        17        Not placed

[5 rows x 8 columns]

3.4) Deleting a row.

In [26]:
df=df.drop(3)
df.head()

   Roll No Gender Section  ...  B.Tech_percentage  Backlogs  placement status
0        1      M       A  ...              40.00        18        Not placed
1        2      F       A  ...              71.45         0            Placed
2        3      F       A  ...              45.26        13        Not placed
4        5      M       A  ...              42.52        17        Not placed
5        6      M       A  ...              62.20         6        Not placed

[5 rows x 8 columns]

3.5) Modifying elements.

In [27]:
df.loc[1,'hostler/days scholar']='h'
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                   NaN
1        2      F       A  ...         0            Placed                     h
2        3      F       A  ...        13        Not placed                   NaN
4        5      M       A  ...        17        Not placed                   NaN
5        6      M       A  ...         6        Not placed                   NaN

[5 rows x 9 columns]

4) Applying functions on a dataframe.

In [30]:
def deepu(x):
  if(x<70):
    return(x+0.05)
  else:
    return(x)

In [31]:
df["B.Tech_percentage"]=df['B.Tech_percentage'].apply(deepu)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                   NaN
1        2      F       A  ...         0            Placed                     h
2        3      F       A  ...        13        Not placed                   NaN
4        5      M       A  ...        17        Not placed                   NaN
5        6      M       A  ...         6        Not placed                   NaN

[5 rows x 9 columns]


5) iterations on dataframe.

In [32]:
for index,row in df[df["B.Tech_percentage"]>=80].iterrows():
      print(row["Roll No"],"-",row["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38
18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38


6)Accessing the elements from a dataframe.

In [33]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
1            89.0                      92.4
2            67.0                      68.0
2            67.0                      68.0


7)Different ways to deal with NA's in dataframe.

In [34]:
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                   NaN
1        2      F       A  ...         0            Placed                     h
2        3      F       A  ...        13        Not placed                   NaN
4        5      M       A  ...        17        Not placed                   NaN
5        6      M       A  ...         6        Not placed                   NaN

[5 rows x 9 columns]

8) Groupby operations on dataframe.

In [35]:
grouped=df.groupby("Gender")
grouped["B.Tech_percentage"].agg(np.mean)

Gender
F    71.216735
M    57.343881
Name: B.Tech_percentage, dtype: float64

9) Merging the dataframes.

In [36]:
df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [37]:
df=pd.merge(df,df2,on="Roll No")
df.head()

   Roll No Gender Section  ...  placement status  hostler/days scholar  Urban/Rural
0        1      M       A  ...        Not placed                   NaN        Urban
1        1      M       A  ...        Not placed                   NaN        Urban
2        2      F       A  ...            Placed                     h        Rural
3        2      F       A  ...            Placed                     h        Rural
4        3      F       A  ...        Not placed                   NaN        Urban

[5 rows x 10 columns]